---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinition.OwnerGroup
source: html/4ec35eb2-c09f-deee-7b2d-9f87c24e5f2c.htm
---
# Autodesk.Revit.DB.ExternalDefinition.OwnerGroup Property

Returns or change the group ID of the external parameter definition.

## Syntax (C#)
```csharp
public virtual DefinitionGroup OwnerGroup { get; set; }
```

## Remarks
If failed When set the group, an InvalidOperationException will be thrown.